In [1]:
import numpy as np
import pandas as pd

In [5]:
df = pd.DataFrame({'age': np.random.uniform(10,30,size=(10,))})
df

         age
0  15.649958
1  19.040443
2  15.940829
3  12.768520
4  17.889024
5  13.456631
6  18.175165
7  19.379780
8  21.743063
9  20.993581

In [7]:
legal = (df.age >= 21)*1

In [8]:
legal

0    0
1    0
2    0
3    0
4    0
5    0
6    0
7    0
8    1
9    0
Name: age, dtype: int64

In [11]:
np.where(df.age >=21, 1, 0)

array([0, 0, 0, 0, 0, 0, 0, 0, 1, 0])

In [14]:
df['legal'] = (df.age >=21)+0
df

         age  legal
0  15.649958      0
1  19.040443      0
2  15.940829      0
3  12.768520      0
4  17.889024      0
5  13.456631      0
6  18.175165      0
7  19.379780      0
8  21.743063      1
9  20.993581      0